# -*- coding:utf-8 -*-
"""
Module Description:错误码
Date: 2018-12-13
Author: QL Liu
"""
# 账户1000~1999
# 网关2000~2999
# 逻辑 3000 ~ 4999
# 战斗网关 5000 ~ 5999
# 战斗 6000 ~ 6999
# 聊天 7000 ~ 7999
# 后台 8000 ~ 8999
# 账户

MESSAGE = {0: u"success", 1000: u"参数错误",
           1002: u"用户不存在", 1003: u"方法没找到",
           1004: u"参数需要序列化", 1005: u"密码错误",
           1006: u"绑定账号失败", 1007: u"token 错误",
           1008: u"token过期", 1009: u"账号在其他设备登录",
           1010: u"http头部没加token",  1025: u"该账户已存在",
           8004: u"密码错误",
           8002: u"no cmd",
           8008: u"缺少token",
           8009: u"The user already exists",
           8010: u"超级管理员用户只能有一个",
           8001: u"用户不存在",
           8005: u"token错误",
           8888: u"创建用户成功",
           8889: u"删除用户成功",
           8890: u"修改用户成功",
           9000: u"更新公告成功",
           9001: u"插入公告成功",
           9002: u"公告已存在",
           9003: u"邮件发送成功",
           9004: u"邮件未找到",
           9005: u"邮件删除成功",
           9016: u"角色不存在",
           9017: u"邮件id不存在",
           8011: u"该账户没有权限"
           }

